app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "name", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["content", "asda"], ["name", "asda"], ["created_at", "2020-11-24 16:16:57.430935"], ["updated_at", "2020-11-24 16:16:57.430935"], ["post_id", 1]]
---
    def create
        @comment = @post.comments.create(comment_params)

UPDATE "comments" SET "name" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["name", "Andrei Komolov"], ["updated_at", "2020-11-24 15:57:22.769732"], ["id", 1]]
---
    def update
        @comment.update(comment_params)